# @see https://github.com/Homebrew/homebrew-bundle
# brew: dependencies
# cask: Mac applications
# mas: Mac App Store applications 
# vscode: Visual Studio Code extensions

cask "warp"
cask "google-chrome@canary"
cask "raycast"
cask "visual-studio-code"
cask "proxyman"
cask "zoom"
cask "ticktick"
cask "figma"
cask "postman"
cask "deepl"
cask "rancher"

brew "neovim"
brew "gh"
brew "wget"
brew "git"
brew "curl"
brew "mas"
brew "tldr"
