# @see https://github.com/Homebrew/homebrew-bundle
# brew: dependencies
# cask: Mac applications
# mas: Mac App Store applications 
# vscode: Visual Studio Code extensions
tap "homebrew/bundle"

cask "warp"
cask "google-chrome"
cask "raycast"
cask "visual-studio-code"
cask "proxyman"
cask "zoom"
cask "ticktick"
cask "figma"
cask "postman"
cask "rancher"
cask "discord"

brew "neovim"
brew "gh"
brew "wget"
brew "git"
brew "curl"
brew "mas"

vscode "ahmadawais.shades-of-purple"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "stylelint.vscode-stylelint"
vscode "tal7aouy.icons"
